{ "data": [
 {
   "date": "7/13/10",
   "title": "Boko Haram Leader Gives Condolences for Slain ISI Leaders",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "",
   "Time": null,
   "Platform": "",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "",
   "Imagery": "",
   "Purpose": "",
   "Category": "",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "1/11/12",
   "title": "Boko Haram Leader Addresses Nigerian President, Explains Motivations",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Abu Bakr Shekau, the leader of the Nigeria-based Boko Haram, addressed Nigerian President Goodluck Jonathan in a video speech and explained the group's motivations for its actions. The 15-minute Hausa-language speech was posted on YouTube on January 11, 2012, and a jihadist-produced Arabic-translation was distributed on jihadist forums on January 12. Shekau appears in a room with rifles to his back and a siwak, a teeth-cleaning twig, in his hand. He stated that remarks from President Jonathan and others, that Boko Haram is a \"cancer\" and its members are crazy, motivated him to release the speech. Boko Haram, Shekau declared, obeys the commands of God and only fights those who fight Muslims. He said: \"What we are doing is an order from Allah, and all that we are doing is in the Book of Allah that we follow. We don’t touch anyone but those, and he who says that he will fight Allah, he must not hesitate in watching what might come from behind.\"",
   "Time": 15,
   "Platform": "Youtube",
   "Arabic": null,
   "Hausa": 1,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Federal Government",
   "Imagery": "Fighters/Weapons",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": 1,
   "Make Demand": null,
   "Assert Ideology": 1,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": 1,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "1/12/12",
   "title": "Boko Haram Leader Addresses Nigerian President, Explains Motivations",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Abu Bakr Shekau, the leader of the Nigeria-based Boko Haram, addressed Nigerian President Goodluck Jonathan in a video speech and explained the group's motivations for its actions. The 15-minute Hausa-language speech was posted on YouTube on January 11, 2012, and a jihadist-produced Arabic-translation was distributed on jihadist forums on January 12. Shekau appears in a room with rifles to his back and a siwak, a teeth-cleaning twig, in his hand. He stated that remarks from President Jonathan and others, that Boko Haram is a \"cancer\" and its members are crazy, motivated him to release the speech. Boko Haram, Shekau declared, obeys the commands of God and only fights those who fight Muslims. He said: \"What we are doing is an order from Allah, and all that we are doing is in the Book of Allah that we follow. We don’t touch anyone but those, and he who says that he will fight Allah, he must not hesitate in watching what might come from behind.\"",
   "Time": 15,
   "Platform": "Forum",
   "Arabic": 1,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Federal Government",
   "Imagery": "Fighters/Weapons",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": 1,
   "Make Demand": null,
   "Assert Ideology": 1,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": 1,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "11/29/12",
   "title": "Boko Haram Leader Expresses Solidarity with Al-Qaeda-Affiliates, Fighters",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "The Nigeria-based Boko Haram released a video speech from its leader, Abu Bakr Shekau, expressing his group's solidarity with al-Qaeda-affiliates in Afghanistan, Iraq, North Africa, Somalia and Yemen, and threatening Nigerian security forces with death. Shekau's Arabic-language speech, titled, \"Glad Tidings, O Soldiers of Allah,\" came in a 39 minute, 18 second video and was posted on jihadist forums on November 29, 2012. In addition to the speech, the video shows military training of Boko Haram fighters, and also some guns and equipment taken as spoils from enemy forces. Shekau wished well to fellow fighters on all battlefronts, including Libya, Mali, Somalia and Yemen, and rallied them to continue their jihad. Addressing enemy states, namely, America, Britain, Israel and Nigeria, he defiantly asked if they truly believe that jihad will end with the killing of its leaders such as Usama bin Laden and Abu Yahya al-Libi. Shekau stated: \"The world should witness, and America, Britain, Nigeria and other Crusaders, meaning America and Britain, should witness, and the Jews of Israel who are killing the Muslims in Palestine should witness, and the idolaters should witness, and the apostates and the hypocrites, and Nigeria in particular, should witness, that we are with our mujahideen brothers in the Cause of Allah everywhere, those who did their best to raise high the words of Allah and helped the weak Muslims who are humiliated by the Jews and the Crusader Christians, Allah permitting...\"",
   "Time": 39.18,
   "Platform": "Forum",
   "Arabic": 1,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Fighters/Weapons",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": 1,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "2/25/13",
   "title": "Boko Haram Releases Video of French Family Kidnapped in Cameroon",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Boko Haram released a video of the French family it kidnapped in northern Cameroon on February 19, 2013, and stipulated its demands for their release. The 3 minute, 26 second video was posted by a jihadist on YouTube on February 25, and shows the French family of three adults and four children sitting between two armed men and the fighter acting as the group's spokesman. One of the French male hostages said they were captured by Jama'a Ahl al-Sunnah lil Da'wa wal Jihad (Boko Haram) and the group demands the release of prisoners in Cameroon and Nigeria. In his speech, the spokesman accused France of waging war on Islam and said Boko Haram deployed to save their fellow Muslims. He addressed Nigerian President Goodluck Jonathan and ordered the release of female prisoners, and also directed a message to Cameroonian President Paul Biya, demanding the release of male jihadists. The spokesman added: \"Finally, I say to you, fulfill all of these things, and if you leave one thing from them we will slaughter those we took, we will slaughter those we took.\"",
   "Time": 3.26,
   "Platform": "Youtube",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Federal Government",
   "Imagery": "Victims",
   "Purpose": "Demand",
   "Category": "Kidnapping",
   "Critique Government": null,
   "Make Demand": 1,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": 1,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "3/17/13",
   "title": "Boko Haram Releases Video of Weapons Taken After Police Station Raid",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Boko Haram released a video showing weapons its fighters took following a raid on a police station in Nigeria.The 12 minute, 12 second video was posted on the Shumukh al-Islam forum on March 17, 2013. Footage shows fighters surrounding piles of bullet belts, mobile phones, rifles, and other items spread over the ground, while one man speaks in Hausa and lifts rifles and shouts “Allah is Great”. Another man reads a brief speech in Arabic, stating that the fighters have engaged enemy forces in Borno during the past days, and on Saturday night, “destroyed them” and took their weapons and equipment. He added: “Their words that they thwarted us and repulsed our attack are falsehood. Lying is the talk of the tyrants. Allah made us victorious over them and we will kill all who violate Allah's command, no matter whoever they are, by the command of Allah.”",
   "Time": 12.12,
   "Platform": "Forum",
   "Arabic": 1,
   "Hausa": 1,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Fighters/Weapons",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": null,
   "Make threat": 1,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "4/17/13",
   "title": "Boko Haram Releases Videos of Firearm Training, Speech from Leader",
   "Transcript": false,
   "Group": "Shekau",
   "Description": "Boko Haram, or \"Jama'a Ahl al-Sunnah lil Da'wa wal Jihad,\" a Nigeria-based jihadist group, released three videos, one containing a speech by its leader, Abu Bakr Shekau, and the other two showing fighters participating in firearm training exercises. The three Hausa-language videos were posted on the Shumukh al-Islam forum on April 17, 2013. According to the Arabic message introducing the videos, Shekau discusses people who have no affiliation with the group yet speak in its name in order to receive material support. The two videos of training footage have a combined length of 107 minutes, 35 seconds, and show fighters exercising while carrying guns, taking shooting positions, and firing for target practice.",
   "Time": 107.37,
   "Platform": "Forum",
   "Arabic": 1,
   "Hausa": 1,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Fighters/Weapons",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": 1,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": 1,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "5/12/14",
   "title": "Boko Haram Leader Addresses Captive Girls, Demands Prisoner Exchange",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Abu Bakr Shekau, leader of the Nigeria-based Boko Haram jihadi group affirmed that his organization kidnapped over 300 girls captured from a school in Chibok, Nigeria and announced his willingness to exchange the girls for prisoners. In the 27 minute Arabic and Hausa-language video circulated on May 12, 2014, Shekau spoke of 276 schoolgirls held by his group, which is known both as Boko Haram and \"Jama'a Ahl al- Sunnah lil Da'wa wal Jihad.\" Shekau justified their capture as \"crusaders\" and \"disbelievers\" and announced that many had converted to Islam. Addressing the international outcry that has followed from their April 14, 2014 abduction and subsequent captivity, Shekau taunted American President Barak Obama with the information that many of the captives had converted to Islam and accused global leaders of hypocrisy, stating: \"You do many things, and now you come and you speak about these girls.\" Describing the conditions under which Boko Haram would release the hostages, he announced that, in the case of \"those who did not convert to Islam,\" the girls \"will not get out unless you release our brothers from your prisons.\" The video is the second communication to emerge from Shekau regarding the 276 girls kidnapped from school in Borno state, in the northeast of Nigeria. In the first video, which was circulated on May 5, 2014, Shekau affirmed that his group had captured the girls.",
   "Time": 27,
   "Platform": "",
   "Arabic": 1,
   "Hausa": 1,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "",
   "Purpose": "Demand",
   "Category": "Kidnapping",
   "Critique Government": 1,
   "Make Demand": 1,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "1/13/15",
   "title": "Boko Haram Leader Abu Bakr Shekau Expresses Joy for Charlie Hebdo Attack",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Boko Haram released a visual speech from its leader, Abu Bakr Shekau, expressing joy for the attack at the offices of the French satirical magazine Charlie Hebdo in Paris.The 8-minute, Arabic-language video was uploaded on YouTube on January 13, 2015. Shekau, often shouting while speaking, declared that Muslims must disavow democracy and other manifestations of “polytheism,” and stated about the attacks: “We have felt joy indeed, we in the group of People of the Sunnah for Preaching and Jihad in Some African Territories Called Nigeria. We have felt joy indeed. We have felt joy indeed for what happened inside France. Allah is Great! Allah is Great! We have felt joy, we have felt joy. Glad tidings, glad tidings, O our brothers. Allah is Great! Allah is Great! We have felt joy for what befell the people of France. We have felt joy for what befell the people of France in terms of torment, as their blood was spilled inside their country. Allah is Great!”",
   "Time": 8,
   "Platform": "Youtube",
   "Arabic": 1,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "",
   "Purpose": "Declaration",
   "Category": "Show of support",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "1/15/15",
   "title": "Boko Haram Leader Abu Bakr Shekau Discusses Ideology, Denies Infidel-Branding Muslims without Justification",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Boko Haram released a visual speech from its leader, Abu Bakr Shekau, discussing its ideological method and also denying an accusation that it passes judgment of “takfir” (infidel-branding) on Muslims without justification.The 18-minute, Arabic-language video was uploaded on YouTube on January 13, 2015, the same day as another video in which Shekau expressed joy for the attack at the offices of the French satirical magazine Charlie Hebdo in Paris, France. In the undated video, Shekau, reading from a prepared speech, declared that his group, “People of the Sunnah for Preaching and Jihad,” follows the doctrine of the Prophet Muhammad and Salafists, and that they “call for the Qur'an and the authentic Hadiths”. Regarding infidel-branding without just cause, Shekau claimed that the group’s enemies spread such rumors in order to vilify them to the people, and it is innocent. He stated: “We do not infidel-brand anyone from the Muslims as long as he did not bring that on himself, with a sin he did not bring on himself.”",
   "Time": 18,
   "Platform": "Youtube",
   "Arabic": 1,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Prayers/Sermon",
   "Purpose": "Declaration",
   "Category": "Ideological",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "1/20/15",
   "title": "Boko Haram Leader Speaks on Baga Attack, Condemns Depiction of Muhammad by Charlie Hebdo",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "",
   "Time": null,
   "Platform": "",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "",
   "Imagery": "",
   "Purpose": "",
   "Category": "",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "1/27/15",
   "title": "Alleged Boko Haram Mouthpiece Releases Visual Interview with Group Spokesman about Baga Attack",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Al-Urwa al-Wuthqa Foundation, which identifies itself as the official mouthpiece for “Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad,” or what is known as Boko Haram, released an interview with an individual it identified as the group’s spokesman regarding the attack in Baga.The 12 minute, 11 second, Arabic- and English-subtitled video was distributed on Twitter on January 27, 2015. The spokesman is identified as Abu Musab al-Barnawi, who claimed that Boko Haram only fights those who fight it and does not indiscriminately shed the blood of Muslims. Regarding, Baga, he remarked that it fought the “carriers of the Catodqora stick,” which allies itself with the Nigerian government. Also, addressing enemy forces in not only Nigeria, but Cameroon, Chad, and Niger, Barnawi, stated: “Stop your evil from us; otherwise, just as you raid our houses we will raid your houses. For example, Cameroon started to attack us so we attacked it. Therefore, we say to Niger and Chad that if they stop their assault on us and we will stop our assault on them; otherwise, just as you fight us we will fight you. We will enflame against you a war of which you have not before tasted its bitterness.”",
   "Time": 12.11,
   "Platform": "Twitter",
   "Arabic": 1,
   "Hausa": null,
   "English": 1,
   "French": null,
   "Undefined": "",
   "Target": "",
   "Imagery": "",
   "Purpose": "",
   "Category": "",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": "Narrative/Ideology"
 },
 {
   "date": "1/28/15",
   "title": "English-Speaking Boko Haram Fighter Discusses Group’s Purpose in Video",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "An English-speaking fighter in the Nigeria-based Boko Haram discussed the group’s purpose in a video, stating that they wage jihad to empower Islamic Shariah and not for land, money, or democracy.The 4 minute, 10 second video was posted on a sharing website on January 27, 2015, and appears to be a forthcoming release from al-Urwa al-Wuthqa Foundation, the official mouthpiece for “Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad,” or what is known as Boko Haram. Al-Urwa Al-Wuthqa had previously published scenes from the video, indicating that the English-speaking fighter and his colleagues are in Gambaru, a city on the Nigeria-Cameroon border. In the video, the fighter explained that Boko Haram fights those people who try to impose their own religion, and threatened media channels. He stated: “So just allow us to do our religion. Whoever use against us with our religion, even from the broadcasting service, broadcasting service of radio or wherever, if you want to disorganize our religion, we also want to disorganize you. We'll kill you wherever we see you. So because of that we encourage everybody to repent.”",
   "Time": 4.1,
   "Platform": "",
   "Arabic": null,
   "Hausa": null,
   "English": 1,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Fighters/Weapons",
   "Purpose": "Declaration",
   "Category": "Ideological",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": 1,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": "Posturing"
 },
 {
   "date": "2/9/15",
   "title": "Boko Haram Leader Abu Bakr Shekau Challenges Chad-led Coalition in Video",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Abu Bakr Shekau, leader of the Nigeria-based jihadi group Jama’at Ahl al-Sunnah Lil Dawa wal Jihad, or what is known as “Boko Haram,” challenged the Chad-led coalition and called the 7,000 deployed troops a small number. Shekau delivered his speech in Arabic and Hausa in a 28-minute video uploaded on YouTube on February 8, 2015. Standing with armed and masked fighters, Shekau addressed Idriss Deby, the President of Chad, demanding that he repent and questioning how many Boko Haram fighters his troops have really killed and when they entered Gambaru. He stated: “You sent seven thousand of your soldiers. Why didn't you send seven million? This is few... only seven thousand!? By Allah, it is small. We can capture them in an attempt or two. It is possible for us to capture them in a single attempt or two... Why didn't you send seven million, seven billion, or seven trillion...”",
   "Time": 28,
   "Platform": "Youtube",
   "Arabic": 1,
   "Hausa": 1,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Federal Government",
   "Imagery": "Fighters/Weapons",
   "Purpose": "Demand",
   "Category": "Show of Strength",
   "Critique Government": 1,
   "Make Demand": 1,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "2/9/15",
   "title": "Boko Haram Releases Video on Implementing Shariah Law on Muslims in Nigeria",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "",
   "Time": null,
   "Platform": "",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "",
   "Imagery": "",
   "Purpose": "",
   "Category": "",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "2/21/15",
   "title": "Boko Haram Video Shows Attacks in Baga, Maiduguri",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "",
   "Time": null,
   "Platform": "",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "3/2/15",
   "title": "Boko Haram Beheads Two Spies in Video",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Al-Urwa Al-Wuthqa Foundation, the media division of the Nigeria-based jihadi group Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad, or what is known as “Boko Haram,” released the first episode in a series called “Harvest of Spies,” showing the beheading of two men. The 6 minute, 7 second video, which features Arabic, English, and French subtitles, was posted on Twitter on March 2, 2015. The video borrows certain elements from productions by the Islamic State (IS), such as the sound of a beating heart and heavy breathing immediately before the scene of execution. While two spies are identified, Dawoud Muhammad and Muhammad Awlu, only Dawoud is interviewed in the video. He said that he, Muhammad, and a third man were paid to gather information on residents. The act of beheading the two men is not shown.",
   "Time": 6.7,
   "Platform": "Twitter",
   "Arabic": 1,
   "Hausa": null,
   "English": 1,
   "French": 1,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Victims",
   "Purpose": "Display",
   "Category": "Execution",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": 1,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "3/9/15",
   "title": "Boko Haram Pledges Allegiance to IS Leader Abu Bakr al-Baghdadi",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Abu Bakr Shekau, head of the Nigeria-based jihadi group Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad, or what is known as Boko Haram, pledged allegiance to Islamic State (IS) leader Abu Bakr al-Baghdadi. The Arabic audio of his pledge came in an 8 minute, 24 second video produced by the group’s al-Urwa al-Wuthqa Media Foundation, and was posted on Twitter on March 7, 2015. The video contains English and French subtitles. Abu Bakr Shekau urged Muslims everywhere to pledge allegiance to Baghdadi out of an alleged religious duty and to “enrage the enemy of Allah”. The pledge comes after months of Shekau and Boko Haram’s media describing the group as an “Islamic State,” and the IS acknowledging in the fifth issue of “Dabiq” magazine, which was released in November 2014, that it received a pledge from Nigeria and that it accepted it.",
   "Time": 8.24,
   "Platform": "Twitter",
   "Arabic": 1,
   "Hausa": null,
   "English": 1,
   "French": 1,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "",
   "Purpose": "Declaration",
   "Category": "Ideological",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": 1,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": 1,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "6/2/15",
   "title": "Video Shows IS'S \"West African Province\" In Combat, Fighters Touting Victories",
   "Transcript": true,
   "Group": "IS WA",
   "Description": "The Islamic State’s (IS) “West African Province,” formerly known as Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad (Boko Haram), released a video showing fighters explaining the areas controlled by the group and also showed scenes of combat. The nine-minute, 59-second video, titled, “Attacks by the Soldiers of the Caliphate in West Africa,” was released on June 2, 2015. The release marks the first video showing combat from IS’s West African Province with Nigerian forces. In the video, a fighter countered claims that attacks by the government were diminishing its operations, and claimed that the group was thriving in the areas it controls. Scenes of combat showed fighters firing from trucks while driving down a highway, and also showed dead bodies on the ground afterward. Later in the video, fighters showed what was presented as a downed “Nigerian military jet,” which they alleged was shot down the morning of the scene’s filming.",
   "Time": 9.59,
   "Platform": "",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Victims",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "6/23/15",
   "title": "IS' West Africa Releases Video of a Battle and its Spoils",
   "Transcript": false,
   "Group": "IS WA",
   "Description": "West Africa Province, the Islamic State (IS) division formerly known as “Boko Haram,” released a video showing scenes from a battle and its captured spoils. The 4 minute, 46 second video was distributed on Twitter on June 23, 2015. The location of the attack was not identified. Footage shows fighters engaged in a clash, using light and medium weapons, and shows dead bodies of the enemy and weapons and ammunition taken as spoils.",
   "Time": 4.46,
   "Platform": "Twitter",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Attacks",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "7/10/15",
   "title": "IS' West Africa Province Releases Video of Attack on Nigerian Security Forces, Beheading Soldier",
   "Transcript": true,
   "Group": "IS WA",
   "Description": "West Africa Province, the division of the Islamic State (IS) formerly known as “Boko Haram,” released a video of attacking Nigerian security forces and beheading a captured soldier. The 10 minute, 9 second video is the second episode in the “Assaults of the Soldiers of the Caliphate in West Africa Province” series, and was distributed on Twitter on July 10, 2015. Footage shows fighters mounting an attack on barracks and headquarters of Nigerian security forces in an unidentified area, and beheading a captive. It also shows various weapons and gear taken as spoils.",
   "Time": 10.9,
   "Platform": "Twitter",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Attacks",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": 1,
   "Make threat": null,
   "Affiliation to IS": 1,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "7/22/15",
   "title": "Fighters in IS' West Africa Province Give EID Greetings, Threaten Enemy",
   "Transcript": true,
   "Group": "IS WA",
   "Description": "West Africa Province, the division of the Islamic State (IS) formerly known as “Boko Haram,” released a video featuring fighters giving Eid al-Fitr greetings, one of whom threatens the enemy with future attacks.The 9 minute, 7 second video was distributed on Twitter on July 22, 2015. The production begins with Muslims praying in the areas of Hamdala and Sambisa in Nigeria, and listening to a sermon in Sambisa, and then shows three fighters giving speeches with English subtitles. Two of the fighters urged Muslims to embrace jihad and support Islam. The third fighter, in addition to thanking God for Eid, addressed the enemy, declaring: “We haven't been driven out of the land, and we are coming to you. Be prepared. We are coming to you, so wait and see. We will be coming from where you never expected, stronger than before, Insha'Allah [Allah willing]. That is what I briefly wished to say”.",
   "Time": 9.7,
   "Platform": "Twitter",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Prayers/Sermon",
   "Purpose": "Display",
   "Category": "Ideological",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": 1,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": 1,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "8/2/15",
   "title": "IS' West Africa Province Video Shows Beheading of Soldier, Attacks on Barracks in Borno, Yobe",
   "Transcript": true,
   "Group": "IS WA",
   "Description": "West Africa Province, the division of the Islamic State (IS) formerly known as “Boko Haram,” released a video showing attacks on Nigerian army barracks in Borno and Yobe states, and the beheading of a soldier. The 8 minute, 13 second video, entitled, “Knights of Africa,” was distributed on Twitter on August 2, 2015. Footage shows fighters storming enemy targets in the two areas and taking weapons and vehicles as spoils, and then presents the beheading of a soldier. In a separate scene, an unidentified fighter gave a speech while sitting with the plundered weapons and ammunition, calling on Muslims to wage jihad, and claiming that the enemy has not forced the group from its positions. He stated: “The tawaghit [tyrants] said they drove us out to Sambisa. Everyone knows that this place here is not Sambisa. We are still present everywhere we had The following materials are for information purposes only and may not be copied, reproduced, or transmitted without the explicit permission of SITE Intelligence Group and specific attribution to SITE Intelligence Group. 120 been before”.",
   "Time": 8.13,
   "Platform": "Twitter",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Attacks",
   "Purpose": "Display",
   "Category": "Execution",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": 1,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "8/16/15",
   "title": "IS' West Africa Province Leader Shekau Denies Reports of Death, Sickness",
   "Transcript": false,
   "Group": "IS WA",
   "Description": "Abu Bakr Shekau, the head of West Africa Province of the Islamic State (IS), denied reports that he is dead or sick and unable to speak, and vowed to continue fighting the Nigerian government. West Africa Province, the IS division formerly known as “Boko Haram,” released the 8 minute, 5 second Hausa audio speech and what it called an Arabic translation on Twitter on August 16, 2015. In the Arabic message, Shekau addressed IS chief Abu Bakr al-Baghdadi as well as Chadian President Idriss Deby and Nigerian President Muhammadu Buhari, telling them that he is alive. Regarding Buhari in particular, he stated: “Their lying chief - Buhari - raised his weapons and claimed that he will eliminate us in three months. O Buhari, why did you not say in three years? I will fight you, Allah permitting, until the whole land is ruled by Allah, Glorified and Exalted be He”.",
   "Time": 8.5,
   "Platform": "Twitter",
   "Arabic": 1,
   "Hausa": 1,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Federal Government",
   "Imagery": "",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": 1,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": 1,
   "Affiliation to IS": 1,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "10/7/15",
   "title": "Fighters in IS' West Africa Province Renew Pledge to Baghdadi, Reject Enemy Claims of Surrender",
   "Transcript": true,
   "Group": "IS WA",
   "Description": "Fighters in West Africa Province, the Islamic State (IS) division formerly known as Boko Haram, renewed their pledge of allegiance to Abu Bakr al-Baghdadi in a video, and rejected enemy claims that up to 200 fighters surrendered. The 16 minute, 56 second video, entitled, “Messages from the Soldiers of the Caliphate in West Africa Province,” was distributed on Twitter on October 7, 2015. In the production, an unidentified fighter gave a speech in Arabic and then in Hausa in which the group denied claims by the Nigerian government that up to 200 fighters surrendered and turned over their weapons. He said about this claim: “This is an utter lie, slander, and baseless falsehood. This is part of the media war and the invasion of foolish ideology. They have inherited this from their grandfathers the Jews”. The fighter also urged Muslims in West Africa to join the IS and pledge to its leader, Abu Bakr al-Baghdadi.",
   "Time": 16.56,
   "Platform": "Twitter",
   "Arabic": 1,
   "Hausa": 1,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": 1,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": 1,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "10/10/15",
   "title": "IS' West Africa Province Releases Video On Repelling Army Advance in Borno",
   "Transcript": true,
   "Group": "IS WA",
   "Description": "West Africa Province, the division of the Islamic State (IS) formerly known as Boko Haram, released a video of its fighters repelling an advance by the Nigerian army in Borno State, and showing the beheading of a captured soldier. The 5 minute, 42 second video was distributed on Twitter and pro-IS Telegram channels on December 10, 2015. Footage shows fighters clashing with enemy forces, dead bodies of slain soldiers, and the beheading of one soldier who was taken captive. It also shows the weapons and gear taken as war spoils.",
   "Time": 5.42,
   "Platform": "Telegram and Twitter",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Victims",
   "Purpose": "Display",
   "Category": "Execution",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": 1,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "10/14/15",
   "title": "Fighters in IS' West Africa Province Urges Shabaab To Pledge To Baghdadi",
   "Transcript": true,
   "Group": "IS WA",
   "Description": "West Africa Province of the Islamic State (IS) in Nigeria released a video featuring a fighter urging his counterparts in the Somalia-based Shabaab al-Mujahideen Movement to pledge allegiance to IS leader Abu Bakr al-Baghdadi. The 6 minute, 54 second video was distributed on Twitter and pro-IS Telegram channels on October 14, 2015, and comes nearly two weeks after IS provinces in Iraq, Sinai, Syria, and Yemen contributed to a propaganda campaign courting the Shabaab to pledge to Baghdadi and thus disassociate from al-Qaeda. The unidentified fighter in the IS’ West Africa Province, the division formerly known as Boko Haram, reiterated what fighters in other IS provinces told the Shabaab, which is that pledging to the “Caliph” is mandatory, and there is strength in the unity of all fighters. He stated: “O brothers, we are calling on you to follow your brothers who preceded you in pledging allegiance to the Caliph of the Muslims, the Sheikh of Islam, Abu Bakr al-Baghdadi, may Allah preserve him, just as our brothers did in Sinai, Libya, Yemen, and West Africa – those who were Jama’at Ahl al-Sunnah Lil Da’wa Wal Jihad”.",
   "Time": 6.54,
   "Platform": "Telegram and Twitter",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "",
   "Purpose": "Display",
   "Category": "Ideological",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": 1,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": 1,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "11/27/15",
   "title": "IS' West Africa Province Video Shows Scenes From Suicide Bombing, Clash",
   "Transcript": true,
   "Group": "IS WA",
   "Description": "",
   "Time": null,
   "Platform": "",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "",
   "Imagery": "",
   "Purpose": "",
   "Category": "",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "3/31/16",
   "title": "IS' West Africa Province Rejects Enemy \"LIES,\" Pledges To Continue Jihad Under Abu Bakr Shekau",
   "Transcript": true,
   "Group": "IS WA",
   "Description": "West Africa Province, the Nigeria-based division of the Islamic State (IS) formerly known as \"Boko Haram,\" released a video rejecting enemy \"lies\" and pledging to continue waging jihad under Abu Bakr Shekau and Abu Bakr al-Baghdadi. The 12 minute, 56 second, Arabic-subtitled video, entitled, \"Verify It,\" was distributed on Telegram and Twitter on March 31, 2016. Footage shows fighters driving military vehicles to an unidentified location, where they stand together as one delivers a speech. The speaker claimed that due to the inability of regional armies to defeat West Africa Province militarily, they resorted to the media to portray the opposite, that the \"enemies of Allah\" are strong and successful against the fighters. He invited the enemy to Islam, announcing: Our conflict will not end with you until you believe in Allah, Glorified and Exalted be He, through Islam. If you refuse and remain arrogant, then we go forth under the command of the governor of West Africa Province, Sheikh Abu Bakr al-Shekawi, may Allah preserve him, and embitter your lives, make widows of your women, and orphans of your children. Your situation will be the same as the situation of the soldiers of the tyrant in Iraq, Sham [Syria], Libya, Khorasan, and Sinai, with permission from Allah the One, the Subduer.",
   "Time": 12.56,
   "Platform": "Telegram and Twitter",
   "Arabic": 1,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Fighters/Weapons",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": 1,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": 1,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "6/7/16",
   "title": "IS' 'AMAQ News Agency Shows Attack On Nigerien and Nigerian Forces in Bosso",
   "Transcript": false,
   "Group": "IS WA",
   "Description": "Amaq News Agency, a media division of the Islamic State (IS), released a video showing IS’ West Africa Province (formerly known as “Boko Haram”) attacking Nigerian and Nigerien Army forces in the border town of Bosso. The one minute, seven second video was released on June 7, 2016, and shows IS militants attacking via foot and weapon-mounted vehicles. West Africa Province originally claimed the ttack in a June 4 communique, in which it claimed to kill 35 and wound nearly 70.",
   "Time": 1.7,
   "Platform": "",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Attacks",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "7/5/16",
   "title": "IS' West Africa Province Releases Video of Attack On Military Camp in Bosso (Niger)",
   "Transcript": true,
   "Group": "IS WA",
   "Description": "West Africa Province, the division of the Islamic State (IS) formerly known as “Boko Haram,” released a video on its attack in early-June 2016 on a Nigerien and Nigerian military camp in Bosso. The 14-minute video, entitled, “Invading Niger: Scenes from Liberating the Nigerian Apostate Army Camp in the Area of Bosso,” was distributed on Telegram and Twitter on July 5, 2016. West Africa Province had issued a communique about the attack on June 4, stating that its fighters killed 35 soldiers and wounded nearly 70 from both armies. In its al-Naba newspaper, the IS added that the fighters had seized control over the camp after the second consecutive day of clashes. Footage shows the fighters engaged in the attack, “apostates” leaving the area, and war spoils taken by the group.",
   "Time": 14,
   "Platform": "Telegram and Twitter",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Attacks",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "8/4/16",
   "title": "Abu Bakr Shekau Criticizes IS' West Africa \"Governor\" in Alleged Audio, Exposes Rift in Group",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "",
   "Time": null,
   "Platform": "",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "",
   "Imagery": "",
   "Purpose": "",
   "Category": "",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "8/7/16",
   "title": "\"Boko Haram\" Leader Shekau Appears in New Video, Vows America and Nigeria Will be Defeated",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Abu Bakr Shekau, the leader of Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad (\"Boko Haram\"), appeared in a new video challenging reports of his death and vowing that America and Nigeria will be \"defeated\". The 24 minute, 40 second video was uploaded on YouTube on August 7, 2016. At the beginning of the production from the group's media department and not the IS' West Africa Province, an individual gives a speech in front of a large group of fighters, refusing to follow Abu Musab al- Barnawi, the figure the IS appointed as the local \"governor\". Afterwards, Shekau appears with two fighters and gives a speech in Arabic, telling the enemy to \"die in your frustration\" and that he will die only when God destines that it happen. Referencing his audio speech released on August 3, Shekau stated that they do not fight Muslims and do not consider \"infidel\" anyone not branded so by God.",
   "Time": 24.4,
   "Platform": "Youtube",
   "Arabic": 1,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Fighters/Weapons",
   "Purpose": "Threat",
   "Category": "Show of Strength",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": 1,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": 1,
   "Affiliation to IS": null,
   "Claim to Leadership": 1,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "8/8/16",
   "title": "\"Boko Haram\" Fighter Challenges IS' Appointment of Barnawi, Threatens Nigeria to Take War to Capital",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "A fighter in Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad (\"Boko Haram\") acting as a spokesman, challenged the Islamic State (IS) appointing Abu Musab al-Barnawi as its local leader, effectively replacing Abu Bakr Shekau, and threatened Nigeria that the fighters will take the war to the capital, Abuja. The segment with the unidentified fighter speaking Arabic and Hausa is featured at the beginning of the 24 minute, 40 second video in which Shekau later appeared, and that was uploaded on YouTube on August 7, 2016. The fighter's remarks on Barnawi and the displeasure with learning of Shekau's replacement indirectly follows an audio from Shekau on August 3 in which he voiced similar complaints. The fighter, standing among a large group of his colleagues, declared that they will follow Shekau and not Barnawi, for Barnawi \"does not follow a sound doctrine from authentic Salafism\".",
   "Time": 24.4,
   "Platform": "Youtube",
   "Arabic": 1,
   "Hausa": 1,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Fighters/Weapons",
   "Purpose": "Threat",
   "Category": "Show of Strength",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": 1,
   "Affiliation to IS": null,
   "Claim to Leadership": 1,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "8/14/16",
   "title": "\"Boko Haram\" Releases Video of Chibok Schoolgirls, Alleges Some Killed in Airstrikes",
   "Transcript": false,
   "Group": "Shekau",
   "Description": "Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad, or what is known as \"Boko Haram,' released a video on the Chibok schoolgirls it kidnapped in April 2014, showing some of those alive, and some allegedly killed in airstrikes. The 11 minute, 25 second, Hausa-language video was uploaded on YouTube on August 14, 2016, and shared by a Nigerian journalist on Twitter. It displays an English title, \"Message from Jama’aty Ahus Sunnah Lidda Awati Wal Jihad to the Family of Chibok Girls and FG [Federal Government,\" and features three segments. According to the Nigerian journalist who shared the link to the video, one segment shows a fighter giving the group's demands, another shows that fighter discussing with a girl how airstrikes have killed many of the kidnapped, and the third shows the bodies of the girls killed in one such airstrike.",
   "Time": 11.25,
   "Platform": "Youtube",
   "Arabic": null,
   "Hausa": 1,
   "English": 1,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Victims",
   "Purpose": "Display",
   "Category": "Kidnapping",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "8/15/16",
   "title": "IS' West Africa Province Releases Video on Clashes with Nigerian, African Coalition Forces",
   "Transcript": true,
   "Group": "IS WA",
   "Description": "West Africa Province, the Nigeria-based division of the Islamic State (IS) comprised of former “Boko Haram” fighters, released a video on its clashes with Nigerian and African coalition forces, and a fighter encouraging Muslims to come to IS-held territories. The 13 minute, 48 second video, entitled, “Scenes from the Course of Battles on the Front of West Africa Province,” was distributed on Telegram and Twitter on August 15, 2016. The unidentified fighter who speaks in the video did not mention the issues raised by former West Africa Province leader Abu Bakr Shekau about his replacement and continuing to release messages outside of the IS media machine. Instead, the fighter called on Muslims to come to the “land of Islam” and for his counterparts in other IS provinces and those in Libya in particular to persevere and be patient. Footage shows clashes in three areas of Nigeria’s Borno State, two with the Nigerian army, and one with African coalition forces. The attack on the African coalition forces, in Mada village, involved a suicide bombing.",
   "Time": 13.48,
   "Platform": "Telegram and Twitter",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Attacks",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": null,
   "Make threat": 1,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "9/14/16",
   "title": "Boko Haram Releases Video on Eid al-Adha Prayers, Sermon in Borno (Nigeria)",
   "Transcript": false,
   "Group": "Shekau",
   "Description": "Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad, or what is known as “Boko Haram,” released a video on prayers and activities for Eid al-Adha in Nigeria’s Borno State.The 12 minute, 58 second video, entitled, “Blessed Eid,” was uploaded on YouTube on September 13, 2016. It has Arabic captions identifying the areas of Sambisa, North Sambisa, and “Shabab al-Islam,” while the sermon delivered by an unidentified individual is in Hausa. Footage shows scores of people praying indoors and outdoors, and watching a men ride on horses. According to reports, the Hausa speaker declared that Boko Haram remains despite the Nigerian government claiming to have eliminated it, and that Abu Bakr Shekau continues to serve as the leader of the group. He also identified the video as being recorded on September 12, 2016.",
   "Time": 12.58,
   "Platform": "Youtube",
   "Arabic": 1,
   "Hausa": 1,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Prayers/Sermon",
   "Purpose": "Declaration",
   "Category": "Ideological",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": 1,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": 1,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "9/25/16",
   "title": "Boko Haram Leader Rejects Rumors of Injury or Death, Defends Against Criticism in Video Speech",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Abu Bakr Shekau, the leader of Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad (\"Boko Haram\"), gave a video speech in Arabic rejecting rumors of his injury or death, and defending his group against charges of infidel-branding all Muslims unjustly. The 38 minute, 36 second video was uploaded on YouTube on September 24, 2016, and comes nearly six weeks after the last video of Shekau to surface, in which he also challenged reports of his demise. Sitting between two armed fighters and in front of stacks of books, Shekau identified himself as the leader of \"Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad in West Africa of the Islamic State,\" and declared that he and his group are well. He said: \"O tyrants, I am healthy and well and at peace, Allah permitting. There is nothing wrong with me. I will only die when my time has come, and no one dies before his determined time, and it cannot be delayed\". After speaking on his status, Shekau launched into a religious discussion on Muslims who are to be branded infidels, and explained the creed and methodology of his group. He did not mention the past issue he and his fighters raised over the Islamic State (IS) appointing Abu Musab al-Barnawi the \"governor\" of West Africa Province, and Shekau releasing productions independent of the IS, using the former name of the group.",
   "Time": 38.36,
   "Platform": "Youtube",
   "Arabic": 1,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Books",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": 1,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "12/30/16",
   "title": "Boko Haram Leader Shekau Declares in Video That Group Remains Despite Buhari Claiming Otherwise",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Abu Bakr Shekau, the leader of Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad (\"Boko Haram\"), appeared in a video rejecting claims by Nigerian President Muhammadu Buhari that the group is defeated.Two parts from the video, one featuring his Arabic speech and the other his Hausa message, totaling 24 minutes, 14 seconds, were uploaded on YouTube on December 29, 2016. Standing in front of trucks and armed fighters, Shekau stated in Arabic that Buhari is a \"liar,\" and that the fighters have not been defeated and they continue to bear arms. He also referenced West Africa Province of the Islamic State (IS), and indicated that he is the leader, despite the IS having previously removed him from that position and replacing him with Abu Musab al-Barnawi.",
   "Time": 24.14,
   "Platform": "Youtube",
   "Arabic": 1,
   "Hausa": 1,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Fighters/Weapons",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": 1,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": 1,
   "Claim to Leadership": 1,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "2/13/17",
   "title": "IS' West Africa Province Video Shows Clashes with African Coalition Forces, Identifies \"Crusader\" Military Bases in Region",
   "Transcript": false,
   "Group": "IS WA",
   "Description": "West Africa Province, the Nigeria-based division of the Islamic State (IS) which is comprised of former \"Boko Haram\" fighters, released a video showing clashes with African coalition forces in the Lake Chad and Farouq Forest areas, and identifying “Crusader” military bases in the region. The 13 minute, 20 second video, entitled, “The Blaze of the Sharp Swords,” was distributed online on February 13, 2017. Scenes from prior photo reports published by West Africa Province appear in the video, including the December 10 and December 16, 2016, releases, showing fighters stationed in the Lake Chad area, and the December 3 publication, featuring stills of clashes near the town of Kangaraw in Nigeria’s Borno State. During the segment on the group’s implementation of Shariah law in the Lake Chad area, an English-speaking fighter gives a speech about its goals. In another segment, as the video’s narrator discusses enemy forces waging war on fighters in the region, maps onscreen show a French military base in the Chadian capital, N’Djamena, and a UN base in Mali.",
   "Time": 13.2,
   "Platform": "",
   "Arabic": null,
   "Hausa": null,
   "English": 1,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "Attacks",
   "Purpose": "Declaration",
   "Category": "Ideological",
   "Critique Government": null,
   "Make Demand": null,
   "Assert Ideology": 1,
   "Claim or Support Attack": 1,
   "Execution": null,
   "Make threat": 1,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "3/15/17",
   "title": "“Boko Haram” Releases Video of Executing Three Spies, One by Beheading",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad, or what is known as “Boko Haram,” released a video of executing three spies, two by gunshot and one by beheading. The 7 minute, 18 second, Arabic- and Hausa-language video was uploaded on YouTube on March 13, 2017. While it opens with the now-familiar introduction from videos by Islamic State (IS) “provinces,” this production is not from West Africa Province, but from Boko Haram’s own media unit, indicating that the group still considers itself part of the IS, but with some degree of autonomy. Footage shows an interview with two alleged spies for Nigerian security, and then their execution and that of a third individual. Prior to the execution, a fighter declared in a speech: “[Nigerian President Muhammadu] Buhari, here are your agents whom you sent, and Allah had revealed them. They do not have a punishment from us other than death, Allah permitting.”",
   "Time": 7.18,
   "Platform": "Youtube",
   "Arabic": 1,
   "Hausa": 1,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Federal Government",
   "Imagery": "Victims",
   "Purpose": "Display",
   "Category": "Execution",
   "Critique Government": 1,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": 1,
   "Make threat": null,
   "Affiliation to IS": 1,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "3/23/17",
   "title": "Boko Haram Leader Shekau Insists to Maintain Leadership Over IS Division in Nigeria",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Abu Bakr Shekau, the leader of Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad (\"Boko Haram\"), insisted in his latest video appearance that he remains the leader of the Islamic State’s (IS) West Africa Province. SaharaTV uploaded a large portion from the video on YouTube on March 17, 2017. In the Arabic portion of his speech, Shekau declared that the IS will remain in West Africa under his command, and claimed that the presidents of Cameroon, Chad, Niger, and Nigeria “deluded” their respective peoples. According to a translation of the Hausa portion of his speech, the Boko Haram leader refuted Cameroonian President Paul Biya’s assertion of crushing the group, and declared that all bombings in Maiduguri were carried out by Boko Haram and they will continue such attacks.",
   "Time": null,
   "Platform": "Youtube",
   "Arabic": 1,
   "Hausa": 1,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "",
   "Purpose": "Display",
   "Category": "Show of Strength",
   "Critique Government": 1,
   "Make Demand": null,
   "Assert Ideology": null,
   "Claim or Support Attack": 1,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": 1,
   "Claim to Leadership": 1,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "7/30/17",
   "title": "Boko Haram Video Shows Captured Oil Explorations Contractors",
   "Transcript": false,
   "Group": "Shekau",
   "Description": "Boko Haram released a video showing three oil exploration contractors, abducted in a raid in northeastern Nigeria on July 25, 2017. According to one of hostages, the three prisoners are employees of the University of Maiduguru and were contracted by the Nigerian National Petroleum Corporation (NNPC) for an exploration project in the Lake Chad Basin. The speaker, identifying himself as a university lecturer, emphasized that the group had been taken on July 25, but that the video was recorded on July 28. In the video, the hostage appealed to members of the university, government officials, energy groups collaborating with the NNPC exploration project, the “entire media community,” and the Nigerian nation to “meet the demand of soldiers of Khalifa under the leadership of Abu Musab al-Barnawi” and advised that “use of excessive force—it is not the solution.” The hostage added: “We want to call on the federal government to meet this demand...They have promised us that if their demands are met, they will release us immediately.” Sahara TV, which describes itself as an \"online news medium,\" and has received videos from Boko Haram in the past, uploaded the four-minute, 30-second production to its YouTube channel on July 29, 2017.",
   "Time": 4.3,
   "Platform": "Youtube",
   "Arabic": null,
   "Hausa": null,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Federal Government",
   "Imagery": "Victims",
   "Purpose": "Demand",
   "Category": "Kidnapping",
   "Critique Government": null,
   "Make Demand": 1,
   "Assert Ideology": null,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": null,
   "FIELD25": "",
   "FIELD26": ""
 },
 {
   "date": "8/16/17",
   "title": "Boko Haram Leader Shekau Declares IS Will Remain in West Africa",
   "Transcript": true,
   "Group": "Shekau",
   "Description": "Abu Bakr Shekau, the leader of Jama’at Ahl al-Sunnah Lil Dawa Wal Jihad (\"Boko Haram”) declared to leaders of West African governments in a video speech that the Islamic State (IS) will remain in the region, and under his local command. “Sahara Reporters” uploaded a portion of Arabic- and Hausa-language video on its YouTube channel on August 16, 2017. The video displays two speeches by Shekau, one a lecture on having faith in Allah despite the circumstances, and the other about “falsehoods” propagated by Nigerian President Muhammadu Buhari. He said, for example:",
   "Time": null,
   "Platform": "Youtube",
   "Arabic": 1,
   "Hausa": 1,
   "English": null,
   "French": null,
   "Undefined": "",
   "Target": "Public",
   "Imagery": "",
   "Purpose": "Declaration",
   "Category": "",
   "Critique Government": 1,
   "Make Demand": null,
   "Assert Ideology": 1,
   "Claim or Support Attack": null,
   "Execution": null,
   "Make threat": null,
   "Affiliation to IS": null,
   "Claim to Leadership": 1,
   "FIELD25": "",
   "FIELD26": ""
 }
]
}
